//
//  Misc.swift
//  Guess the Doodle
//
//  Created by Karyna Kirynskaya on 12/10/2024.
//

import Foundation

let everydayObjects = ["ручка", "стол", "стул", "бумага", "книга", "компьютер", "телефон", "ключи", "бумажник", "часы", "лампа", "кровать", "подушка", "одеяло", "машина", "велосипед", "автобус", "поезд", "пульт", "самолет", "зонт", "солнцезащитные очки", "обувь", "брюки", "носки", "зубная щетка", "шампунь", "кондиционер", "бритва", "полотенце", "столовые приборы", "стакан", "тарелка", "микроволновка", "холодильник", "посудомоечная машина", "стиральная машина", "чистящее средство", "совок", "мусорное ведро", "корзина для белья", "вешалка", "утюг", "расческа", "кусачки для ногтей", "ножницы", "клей", "степлер", "скрепка", "папка", "конверт", "липкая записка", "календарь", "линейка", "компас", "транспортир", "калькулятор", "батарейка", "удлинитель", "питание", "отвертка", "молоток", "гаечный ключ", "скотч"]

enum PlayerAuthState: String {
    case authenticating = "Вход в Game Center..."
    case unauthenticated = "Пожалуйста, войдите в Game Center для игры."
    case authenticated = "Аутентификация выполнена"
    
    case error = "Произошла ошибка при входе в Game Center."
    case restricted = "Вам запрещено играть в многопользовательские игры!"
}

struct PastGuess: Identifiable {
    let id = UUID()
    var message: String
    var correct: Bool
}

let maxTimeRemaining = 100
